In [17]:
pop = {'Ohio':{2012: 100, 2010: 200, 2011: 50, 2013: 150},
       'Illinois':{2010:50, 2011: 100, 2013: 300, 2012: 200}}

In [30]:
import pandas as pd
import numpy as np

In [18]:
frame = pd.DataFrame(pop)

In [21]:
frame.dtypes

Ohio        int64
Illinois    int64
dtype: object

In [6]:
frame.T

          2010  2011  2012  2013
Ohio       200    50   100   150
Illinois    50   100   200   300

In [41]:
arr = [2010,2011,2012,2013,2014]

arr = np.array(arr,dtype=np.int64)

In [42]:
arr

array([2010, 2011, 2012, 2013, 2014], dtype=int64)

In [51]:
frame

      Ohio  Illinois
2010   200        50
2011    50       100
2012   100       200
2013   150       300

In [52]:
frame.columns

Index(['Ohio', 'Illinois'], dtype='object')

In [24]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [26]:
frame3 = pd.DataFrame(pop)

In [27]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [28]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [57]:
'Ohio' in frame

True

In [58]:
'New York' in frame

False

In [60]:
2009 in frame.index

False

In [62]:
2012 in frame.index

True

In [64]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [67]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [69]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [70]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [71]:
obj.reindex

<bound method Series.reindex of d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64>

In [72]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [73]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [74]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [78]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [79]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [84]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),columns=['Ohio','Illinois','New Jersy'],index=['a','b','c'])

In [87]:
frame.reindex(['a','b','c','d'])

   Ohio  Illinois  New Jersy
a   0.0       1.0        2.0
b   3.0       4.0        5.0
c   6.0       7.0        8.0
d   NaN       NaN        NaN

In [88]:
frame.reindex(columns=['New York','Illinois','New Jersy','Ohio'])

   New York  Illinois  New Jersy  Ohio
a       NaN         1          2     0
b       NaN         4          5     3
c       NaN         7          8     6